'use strict'

// # Задание 4

// На счету пользователя есть `23580` кредитов, значение хранится в переменной
// `credits` (создай и присвой). Пользователь решает купить ремонтных дроидов,
// которые стоят по `3000` кредитов за штуку. Цена одного дроида хранится в
// переменной `pricePerDroid` (создай и присвой).

let credits = 23580;
const pricePerDroid = 3000;

// При посещении страницы, используя `prompt`, необходимо спросить количество
// дроидов которые пользователь хочет купить и сохранить в переменную.

const countOfDroids = prompt('Напишите количество дроидов которые пользователь хочет купить')
let totalPrice = 0;
// Напиши скрипт который:

// - Если в `prompt` была нажата кнопка `Cancel`, выводит в консоль сообщение
//   `'Отменено пользователем!'`.
// - В противном случае, рассчитывает общую цену заказа и сохраняет в переменной
//   `totalPrice`.
// - Проверяет сможет ли пользователь оплатить заказ:
//   - если сумма к оплате превышает количество кредитов на счету, выводи в консоль
//     сообщение `'Недостаточно средств на счету!'`.
//   - в противном случае необходимо посчитать остаток кредитов на счету и вывести
//     сообщение
//     `'Вы купили [число] дроидов, на счету осталось [число] кредитов.'`.

if (!countOfDroids) {
	console.log('Отменено пользователем!');
} else if (Number(countOfDroids)){
	totalPrice = pricePerDroid * countOfDroids;
	if (totalPrice > credits) {
		console.log('Недостаточно средств на счету!');
	} else {
		credits -= totalPrice;
		console.log(`Вы купили ${countOfDroids} дроидов, на счету осталось ${credits} кредитов.`);
	}
} else {
	console.log('Вы ввели не число!');
}